Autodesk.Revit.DB.DialogOptions.WorksharingDialogOptions.IsValid
isValid
Since:
2027

Autodesk.Revit.DB.DialogOptions.WorksharingDialogOptions.OtherName
otherName
Since:
2027

Autodesk.Revit.DB.DialogOptions.WorksharingDialogOptions.LevelsGridsViewsName
levelsGridsViewsName
Since:
2027

Autodesk.Revit.DB.DialogOptions.WorksharingDialogOptions.#ctor(System.String,System.String,System.UInt32,System.String)
constructor
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.DialogOptions.WorksharingDialogOptions
The specific class for Worksharing dialog options as the input for ModalDialogCallEventArgs.
Since:
2027